# Ex 4.1  *Column* Operations  
    
    
- [In Class](#In-Class)  


- Exercise 4.1  
  - [Part 1: IMDB database](#Part-1:--IMDB-database)  
  - [Part 2: Alcohol Consumption By Country](#Part-2:-Alcohol-Consumption-By-Country) 
  - [Part 3: Screenscraped IMDB Top 250](#Part-3:--Screensraped-IMDB-Top-250)
    
    
   

- **Local Data Files Required**  
  - Data_Olympics.csv  
  - IMDB_250_Scraped.csv

In [55]:
import pandas as pd

# In Class

### Renaming Columns

In [56]:
# Read CSV file (Data_Olympics.csv) into a dataframe named df
df = pd.read_csv('Data//Data_Olympics.csv')

#Display the first five rows in the dataframe
df.head()

   Rank              Country  Gold  Silver  Bronze  Total
0     1  United States (USA)    46      37      38    121
1     2  Great Britain (GBR)    27      23      17     67
2     3          China (CHN)    26      18      26     70
3     4         Russia (RUS)    19      17      19     55
4     5        Germany (GER)    17      10      15     42

In [57]:
#Show column names
df.columns

Index(['Rank', 'Country', 'Gold', 'Silver', 'Bronze', 'Total'], dtype='object')

#### Rename columns into NEW Dataframe (df_new)
- Gold => gold_medals
- Silver => silver_medals
- Bronze' => bronze_medals

In [58]:
# Rename selected columns into new dataframe
new_columns = {'Gold':'gold_medals', 
               'Silver':'silver_medals', 
               'Bronze':'bronze_medals'}
# Display new dataframe
df_new = df.rename(columns = new_columns, inplace=False)
df_new.head()

   Rank              Country  gold_medals  silver_medals  bronze_medals  Total
0     1  United States (USA)           46             37             38    121
1     2  Great Britain (GBR)           27             23             17     67
2     3          China (CHN)           26             18             26     70
3     4         Russia (RUS)           19             17             19     55
4     5        Germany (GER)           17             10             15     42

#### Rename columns in existing Dataframe (df)
- Gold => Gold Medals
- Silver => Silver Medals
- Bronze => Bronze Medals

In [59]:
df.head(2)

   Rank              Country  Gold  Silver  Bronze  Total
0     1  United States (USA)    46      37      38    121
1     2  Great Britain (GBR)    27      23      17     67

In [60]:
# Rename columns in EXISTING DataFrame
new_columns = {'Gold':'Gold Medals', 'Silver':'Silver Medals', 'Bronze':'Bronze Medals'}

df = df.rename({'Gold':'Gold Medals', 'Silver':'Silver Medals', 'Bronze':'Bronze Medals'}, axis='columns')
df.head()

   Rank              Country  Gold Medals  Silver Medals  Bronze Medals  Total
0     1  United States (USA)           46             37             38    121
1     2  Great Britain (GBR)           27             23             17     67
2     3          China (CHN)           26             18             26     70
3     4         Russia (RUS)           19             17             19     55
4     5        Germany (GER)           17             10             15     42

In [61]:
df.head(2)

   Rank              Country  Gold Medals  Silver Medals  Bronze Medals  Total
0     1  United States (USA)           46             37             38    121
1     2  Great Britain (GBR)           27             23             17     67

### Rename all columns

In [62]:
# Re-read Data_Olympics.csv file to start with a fresh dataframe
df = pd.read_csv('Data//Data_Olympics.csv')

df.columns

Index(['Rank', 'Country', 'Gold', 'Silver', 'Bronze', 'Total'], dtype='object')

In [63]:
df.head(2)

   Rank              Country  Gold  Silver  Bronze  Total
0     1  United States (USA)    46      37      38    121
1     2  Great Britain (GBR)    27      23      17     67

#### Rename *All* columns to: rank country gold silver bronze total

In [64]:
# Create list of new column names
new_column_names = ['rank', 'country', 'gold medals', 'silver medals', 'bronze medals', 'total']

#Change column names
df.columns = new_column_names
df.columns

Index(['rank', 'country', 'gold medals', 'silver medals', 'bronze medals',
       'total'],
      dtype='object')

In [65]:
df.head(2)

   rank              country  gold medals  silver medals  bronze medals  total
0     1  United States (USA)           46             37             38    121
1     2  Great Britain (GBR)           27             23             17     67

### Removing Columns

In [66]:
# Drop the Rank column in df
df = df.drop('rank', axis='columns', inplace=False)
df.columns

Index(['country', 'gold medals', 'silver medals', 'bronze medals', 'total'], dtype='object')

In [67]:
df.head(2)

               country  gold medals  silver medals  bronze medals  total
0  United States (USA)           46             37             38    121
1  Great Britain (GBR)           27             23             17     67

In [68]:
# Drop the Total column
df = df.drop('total', axis='columns', inplace=False)
df.columns

Index(['country', 'gold medals', 'silver medals', 'bronze medals'], dtype='object')

In [69]:
df.head(2)

               country  gold medals  silver medals  bronze medals
0  United States (USA)           46             37             38
1  Great Britain (GBR)           27             23             17

### Removing Multiple Columns

In [70]:
df.head(2)

               country  gold medals  silver medals  bronze medals
0  United States (USA)           46             37             38
1  Great Britain (GBR)           27             23             17

In [71]:
#Drop the Silver and Bronze columns
df.drop(['silver medals', 'bronze medals'], axis='columns', inplace=True)
df.columns

Index(['country', 'gold medals'], dtype='object')

In [72]:
df.head(2)

               country  gold medals
0  United States (USA)           46
1  Great Britain (GBR)           27

# Exercise 4.1

# Part 1:  IMDB database
Using data from: https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/imdb_1000.csv

In [73]:
# 1.Read the above csv file into a pandas dataframe named df_IMDB
df_IMDB = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/imdb_1000.csv')

# 2.Display the first five rows of the dataframe
df_IMDB.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [74]:
# Display the columns
df_IMDB.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [75]:
# Drop the actors_list column in df_IMDB
df_IMDB = df_IMDB.drop('actors_list', axis='columns', inplace=False)
# Display the new columns
df_IMDB.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration'], dtype='object')

In [76]:
# Drop content_rating, genre and duration of df_IMDB
df_IMDB = df_IMDB.drop('content_rating', axis='columns', inplace=False)

# Display the new columns
df_IMDB.columns

Index(['star_rating', 'title', 'genre', 'duration'], dtype='object')

In [77]:
# Display the top five rows of df_IMDB
df.head()

               country  gold medals
0  United States (USA)           46
1  Great Britain (GBR)           27
2          China (CHN)           26
3         Russia (RUS)           19
4        Germany (GER)           17

# Part 2: Alcohol Consumption By Country
Using data from: https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv  

**Create code (in separate code cells) to implement the following:**

1. Read the csv file and create a pickle file named:  drinks.pkl 
2. Read the drinks pickle file into a new dataframe named df_alcohol  
3. Rename the **df_alcohol** columns to: 
  - Country 
  - Beer Servings  
  - Spirit Servings
  - Wine Servings 
  - Pure Alcohol Litres 
  - Continent  
4. Reorder the **df_alcohol** columns to:  
  - Country  
  - Continent  
  - Beer_Servings  
  - Wine_Servings  
  - Spirit_Servings  
  - Pure Alcohol Litres  
  
**Each of the above items should be the comment at the top of its code cell!**

In [78]:
# Read the csv file and create a pickle file named: drinks.pkl 
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv')

df.to_pickle('./Data/drinks.pkl')

In [79]:
# Read the drinks pickle file into a new dataframe named df_alcohol 
df_alcohol = pd.read_pickle('./Data/drinks.pkl')

In [80]:
# Rename the df_alcohol columns
df_alcohol.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [81]:
new_column_names = ['Country', 'Beer Servings', 'Spirit Servings', 'Wine Servings', 'Pure Alcohol Litres', 'Continent']

df_alcohol.columns = new_column_names
df_alcohol.columns

Index(['Country', 'Beer Servings', 'Spirit Servings', 'Wine Servings',
       'Pure Alcohol Litres', 'Continent'],
      dtype='object')

In [82]:
# Reorder the df_alcohol columns
new_cols = ['Country', 'Continent', 'Beer Servings', 'Wine Servings', 'Spirit Servings', 'Pure Alcohol Litres']
new_cols

['Country',
 'Continent',
 'Beer Servings',
 'Wine Servings',
 'Spirit Servings',
 'Pure Alcohol Litres']

In [83]:
df_alcohol = df_alcohol[new_cols]
df_alcohol.head()

,Country,Continent,Beer Servings,Wine Servings,Spirit Servings,Pure Alcohol Litres
0,Afghanistan,Asia,0,0,0,0.0
1,Albania,Europe,89,54,132,4.9
2,Algeria,Africa,25,14,0,0.7
3,Andorra,Europe,245,312,138,12.4
4,Angola,Africa,217,45,57,5.9

### Beer consumption  
- Based on df_alcohol, create a new dataframe named df_beer  
- Drop every column except: Country, Beer_Servings, Continent

In [84]:
df_alcohol.drop(['Wine Servings', 'Spirit Servings', 'Pure Alcohol Litres'], axis='columns', inplace=True)
df_alcohol.columns

Index(['Country', 'Continent', 'Beer Servings'], dtype='object')

#### Display the fifteen countries that consume the least beer

In [85]:
df_alcohol.sort_values(by='Beer Servings', inplace=True, ascending=True)
df_alcohol.head(15)

              Country Continent  Beer Servings
0         Afghanistan      Asia              0
40       Cook Islands   Oceania              0
79               Iran      Asia              0
90             Kuwait      Asia              0
97              Libya    Africa              0
103          Maldives      Asia              0
106  Marshall Islands   Oceania              0
111            Monaco    Europe              0
128          Pakistan      Asia              0
147        San Marino    Europe              0
13         Bangladesh      Asia              0
149      Saudi Arabia      Asia              0
107        Mauritania    Africa              0
158           Somalia    Africa              0
46        North Korea      Asia              0

#### Display the five countries that consume the most beer

In [86]:
df_alcohol.sort_values(by='Beer Servings', inplace=True, ascending=False)
df_alcohol.head(5)

            Country Continent  Beer Servings
117         Namibia    Africa            376
45   Czech Republic    Europe            361
62            Gabon    Africa            347
65          Germany    Europe            346
135          Poland    Europe            343

### Wine consumption  
- Based on **df_alcohol**, create a new dataframe named **df_wine**  
- Drop every column except: Country, Wine_Servings, Continent

In [87]:
# Create a  new dataframe
df_wine = pd.read_pickle('./Data/drinks.pkl')

# Drop every column except: Country, Wine_Servings, Continent
df_wine.drop(['beer_servings', 
              'spirit_servings', 
              'total_litres_of_pure_alcohol'], axis='columns', inplace=True)

#### Display the 10 countries that consume the least wine

In [88]:
df_wine.sort_values(by='wine_servings', inplace=True, ascending=True)
df_wine.head(10)

              country  wine_servings continent
0         Afghanistan              0      Asia
27            Burundi              0    Africa
116           Myanmar              0      Asia
107        Mauritania              0    Africa
106  Marshall Islands              0   Oceania
103          Maldives              0      Asia
102          Malaysia              0      Asia
97              Libya              0    Africa
119             Nepal              0      Asia
95            Lesotho              0    Africa

**Display the 10 countries that consume the most wine**

In [89]:
df_wine.sort_values(by='wine_servings', inplace=True, ascending=False)
df_wine.head(10)

               country  wine_servings continent
61              France            370    Europe
136           Portugal            339    Europe
3              Andorra            312    Europe
166        Switzerland            280    Europe
48             Denmark            278    Europe
156           Slovenia            276    Europe
99          Luxembourg            271    Europe
42             Croatia            254    Europe
83               Italy            237    Europe
55   Equatorial Guinea            233    Africa

### Part 3:  Screensraped IMDB Top 250  

Filename:  IMDB_250_Scraped.csv

1. Read the above csv file into a dataframe named **df_IMDB_250**
1. Remove column named: Column1  
2. Remove column named: Your Rating  
3. Remove column named: 2  
4. Rename column named IMDb Rating to Rating  
5. Rename column named Rank & Title to Rank-Title-Year  
6. Sort by Rating - Highest to lowest

In [90]:
# get and read file
file = 'Data//IMDB_250_Scraped.csv'
df_IMDB_250 = pd.read_csv(file)

# Remove columns named: Column1, Your Rating, 2
df_IMDB_250.drop(['Column1', 'Your Rating', '2'], axis='columns', inplace=True)

# Rename columns
new_columns = {'Rank & Title':'Rank-Title-Year', 'IMDb Rating':'Rating'}
df_IMDB_250 = df_IMDB_250.rename(columns = new_columns, inplace=False)

# Sort by rating
df_IMDB_250.sort_values(by='Rating', inplace=True, ascending=False)
df_IMDB_250.head()

                      Rank-Title-Year  Rating
0  1. The Shawshank Redemption (1994)     9.2
1             2. The Godfather (1972)     9.2
2    3. The Godfather: Part II (1974)     9.0
3           4. The Dark Knight (2008)     9.0
4              5. 12 Angry Men (1957)     8.9